{
    "APP - BUFFERING / LAG": "Select this intent when customers report issues with the app being slow, lagging, buggy, experiencing technical glitches, taking too long to load, or freezing. This includes cases where the system causes multiple identical orders, prevents repeating an order, or shows incorrect wallet balances after a top-up. It also covers situations where orders do not reflect in the app, or where technical glitches impact applying promotions, vouchers, gift cards, sign-ups, logins (including issues where phone numbers are not recognized), or making orders. Additionally, include issues with unrecognized phone numbers upon login and the inability to see friends who joined using their referral code. Exclude cases of technical outages that cause delays or lack of updates for orders.",
    "APP - GIFT CARDS": "Select this when customers mention issues with redeeming gift cards via the app, either for themselves or when the gifted person is having trouble redeeming the gift card in the app. This includes problems related to incorrect recipient information (e.g., phone number, email) impacting gift card redemption or any other issues related to the use of gift cards within the app.",
    "APP - LOYALTY ISSUE": "Select this intent when customers report issues with retrieving loyalty information or incorrect calculations of loyalty points or tiering in the app. This includes cases where customers receive a voucher via email but the discount rate differs from what's displayed in the app, did not receive a specific voucher, or are unable to apply/redeem vouchers or points for discounts. It also covers missing points after purchases, inquiries about forfeited points, vouchers automatically added to accounts, Coffee Club points not being awarded, Cup Count not updating after purchase, missing vouchers in the app, and issues scanning receipt QR codes to collect points. Include scenarios where customers mention phone numbers or emails as part of resolving loyalty issues, as long as the primary problem relates to loyalty points or rewards. This excludes general inquiries about loyalty points or vouchers.",
    "APP - OTP": "Select this intent when customers report issues receiving OTP (One-Time Password) verification via WhatsApp, SMS, or email, including delays causing the OTP to expire or multiple failed attempts to retrieve it. This intent applies whenever an OTP is involved, regardless of whether the customer is trying to update contact information (e.g., changing phone number or email). It also applies when customers are unable to receive the OTP while attempting to change their phone number or log in. The focus is on authentication-related problems where the OTP is not received or accepted, not covering broader payment processing or account balance issues. This excludes cases where the primary issue is updating contact details, phone number validity, or broader technical issues affecting app functionality or login processes.\n\n\n\n",
    "CANCELLATION - INCORRECT ORDER": "Select this when a customer requests to cancel or amend their order due to an issue with the order content or timing. This excludes cases where the primary reason for cancellation is missing a promo code or voucher, even if the customer mentions the order being incorrect. Examples include placing the wrong items, needing to add or remove items, making a duplicate order, or selecting the wrong delivery time. The customer may also need to cancel due to unforeseen circumstances like an accident or emergency. In some cases, location restrictions (such as airport gates) prevent them from picking up the order. The focus of this intent is on correcting or canceling the order itself, rather than simply changing the method of pickup or delivery or addressing operational disruptions at the outlet. This intent should not be used if the cancellation is specifically due to an operational issue at the outlet, such as equipment failure, power outages or system failures.",
    "CANCELLATION - LONG WAITING TIME": "Select this intent when customers request to cancel their order due to extended waiting periods. This includes scenarios where an order was not ready for pickup within 15 minutes, has been delayed beyond 45 minutes, or where the rider has not moved for over 30 minutes. The primary issue is customer frustration over the length of the wait time, whether due to high order volume, outlet inefficiencies, or general delays in preparation or delivery. Technical issues may be a factor, but the main reason for cancellation is time-related, not necessarily tied to specific operational problems like system malfunctions, water supply issues or power-related problem at the outlet. Exclude scenarios where a machine breakdown or other operational issue causes the delay",
    "CANCELLATION - NO RIDER": "Select this intent when customers request to cancel their order specifically due to the unavailability of a rider for delivery. This applies to scenarios where the customer waits more than 30 minutes without a rider being assigned, or where the system automatically cancels the order because of difficulties in assigning a rider. The primary concern is the absence of a rider, which prevents the order from being delivered, leading to automatic cancellation and refund processing. The focus here is on the rider assignment issue rather than general waiting time or other operational delays.",
    "CANCELLATION - WRONG OUTLET / ADDRESS": "Select this when customers request to cancel their order due to selecting the wrong outlet or entering the wrong address. This includes scenarios where the customer mistakenly selected an outlet in a different city or inserted the incorrect address or pinned the wrong location. The cancellation is driven by a customer error in choosing the outlet or address, rather than an operational issue at the outlet itself. Exclude cases whereby agent gives customer a voucher as compensation, that should be \"Wrong Outlet / Address - Voucher Code\". This intent is specific to customer errors in choosing the outlet or address and excludes cancellations caused by operational issues, such as blackouts or power outages at the outlet.",
    "CHANGE / UPDATE INFO": "Select this when customers mention that they want to change their phone number or email on their account. This includes scenarios where the customer requests to update their contact information such as a phone number or email, even if OTP verification is involved. Exclude cases where contact details are mentioned as part of troubleshooting loyalty-related problems, even if phone number verification is required to resolve the issue. Exclude cases where the update is needed to resolve issues related to gift card redemption, or where the primary issue is an OTP failure or redeeming a gift card.",
    "COMPLAINTS": "Select this intent when customers raise complaints that are not tied to specific order-related issues or lack a clear resolution, such as when an agent can only apologize or thank the customer without resolving the issue. This includes general dissatisfaction with service, repeated issues, confusion with app features, or broader company-related complaints. It also includes complaints about incorrect order preparation, confusion or delays in the ordering or preparation process, and dissatisfaction with missing app features or services. This intent also applies to complaints about orders being canceled without notification, issues related to outlet facilities, or concerns about the terms and conditions of promotions, vouchers, or gift cards. Additionally, it covers instances where outlets turn away walk-in customers or customers complain about company-related information. This excludes complaints about hygiene, quality, or matters specifically related to barista performance.",
    "COMPLIMENT (WOW)": "Select this when customers provide positive feedback or praise regarding ZUS. This includes compliments about ZUS staff, products, services, specific outlets, or the overall brand experience. Exclude suggestions.",
    "CUSTOMER UNREACHABLE / UNAVAILABLE": "Select this when the customer did not receive their order because the rider was unable to contact them, leading to the order being returned to the outlet or store. This typically occurs when the rider attempts to call or message the customer but receives no response, resulting in a failed delivery attempt. The defining feature of this category is that the order was not marked as delivered but was instead returned to the store, indicating that the delivery could not be completed due to the customer being unreachable. This includes cases where the rider attempted delivery but was unable to locate the customer due to incomplete or unclear instructions. This category excludes cases where the rider marked the order as delivered or claimed it was completed.",
    "DELIVERY INFO / STATUS": "Select this intent when customers inquire about the status of their order, particularly if they are simply asking for updates or clarifications on the order’s preparation or delivery progress. Use this intent for situations where the customer is not reporting any barista-related issues or service quality problems but is instead focused on the status of the delivery or order completion. This includes both situations where the inquiry is made within 15 minutes of placing the order and when it is made after 15 minutes.",
    "DELIVERY RANGE": "Select this when customers are unable to place an order because their location is outside the delivery range or the app incorrectly handles their address. This includes situations where the customer's address is within the allowable range but the app still prevents ordering, issues with pinning the correct location, or incorrect location pinning by the app.",
    "DOUBLE PAYMENT CHARGES": "Select this intent when customers report being charged twice for a single transaction. This includes cases where the customer is billed twice using the same or different payment methods, such as credit cards, e-wallets, or bank accounts. It involves verifying and addressing the duplicate charges shown in the customer’s bank or transaction history. This intent excludes cases where the customer is simply inquiring whether a double charge has occurred without providing evidence or where the charge is unconfirmed. The primary focus is on confirming and resolving instances of actual double charges.",
    "EMPLOYEE WELFARE (RETAIL OPS)": "Select this when current or ex-employees, affiliates, or staff members complain about working with ZUS or other ZUS staff. This includes complaints about sexual harassment, work environment, culture, management, or pay/salary issues.",
    "FAILED DELIVERY": "Select this when the customer did not receive their order, but the rider marked or claimed it was delivered. This includes cases where the rider delivered to the wrong recipient (wrong person or address), failed to follow delivery instructions (such as not calling the customer on arrival or leaving it at the wrong location), or picked up the order but did not deliver it.  The key distinction is that the order is marked as delivered, despite the customer never receiving it. This category excludes instances where the order was returned to the store due to the customer being unreachable,which should be categorized under \"Customer Unreachable / Unavailable.\" The issue here lies primarily with the delivery execution, not with the restaurant’s system.",
    "FOAM ISSUE": "Select this when customers or agents report problems related to foam or volume in their drinks. This category covers a wide range of concerns, including: coffees that are only half-filled, drinks with excessive foam resulting in less liquid quantity than expected, instances where foam thickness dissipates during delivery leading to perceived volume reduction, beverages that appear to have less volume or quantity than anticipated, and drinks that are not full upon delivery. It also encompasses situations where customers question the serving size due to receiving a cup of coffee that wasn't full, express that the drink was less than expected in terms of volume, or report receiving a drink significantly less in quantity than usual, which may taste too strong due to insufficient milk. Additionally, this classification includes cases where the drink had a thicker foam during preparation, which then dissipated during delivery, causing customer dissatisfaction. Overall, this category captures any dissatisfaction with drink size, measurement, or perceived value related to foam and volume issues, regardless of whether the problem occurred during preparation or delivery.",
    "FRANCHISE": "Select this when customers enquire about franchising ZUS or express interest in investing in a ZUS franchise. This includes questions about how to become a franchisee or invest in the franchise.",
    "FRAPPE ISSUE": "Select this when customers complain about their frappe based drink being melted or diluted, even if it was picked up or delivered within a short timeframe.\n",
    "HOT / ICED MISTAKES": "Select this when customers receive a hot drink instead of an iced one, or vice versa, due to incorrect preparation. It is specific to mistakes related to the temperature of a drink, where the rest of the order is correct but the drink's temperature does not match what was requested. The issue is isolated to the temperature of the drink, not involving multiple items or affecting the entire order. The resolution typically involves resending the correctly prepared drink or offering an adjustment, focusing solely on correcting the drink’s temperature error.",
    "HYGIENE - DRINK": "Select this category when customers report specifically covers complaints where customers report finding a foreign object in their drink, raising concerns about the cleanliness and safety of the beverage.",
    "HYGIENE - FOOD": "Select this category when customers report relates to complaints about food hygiene, including the presence of foreign objects in food or the receipt of expired food items, indicating concerns about the safety and cleanliness of the food provided.\n\n\n",
    "INCORRECT / MISLEADING INFO": "Select this when customers complain about receiving incorrect, confusing, incomplete, misleading information from baristas regarding menu items, ingredients, or other details, even if the information provided was actually correct.",
    "INCORRECT REFUND AMOUNT / CHANNEL": "Select this when customers report receiving an incorrect refund amount or when the refund was processed through the wrong channel.",
    "INQUIRY / METHOD": "Select this when customers inquire about FAQs, loyalty points, vouchers, or promotions without reporting any issues. This includes general questions about available discounts, membership benefits, or redemption methods. Exclude cases where loyalty points or vouchers are missing or incorrect.",
    "KDS & XILNEX ISSUE": "Select this intent when customers or riders report issues related to the Kitchen Display System (KDS) or the Point of Sales (Xilnex) system, which may cause problems such as orders being incorrectly marked as \"delivered\" instead of \"pickup,\" delays due to orders stuck in \"preparing,\" or outlets not receiving orders. The key factor is a technical system failure at the restaurant that affects the processing or preparation of the order. System outages or syncing problems that prevent orders from being fulfilled, leading to delays, cancellations, or refund requests, fall under this category. Importantly, this excludes situations where the delay or cancellation is solely due to waiting times not related to system errors.",
    "MACHINES - BROKE DOWN": "Select this intent when customers are informed that their drink cannot be prepared or significantly delayed due to coffee machines undergoing maintenance or breaking down. Use this intent when machine malfunctions directly cause delays or cancellations. This includes cases where the customer requests a cancellation because the outlet is unable to fulfill the order due to equipment issues. If a machine breakdown is the core issue leading to extended waiting times or order cancellations, this intent should apply. The focus is on operational failures, not on customer frustration purely over delays unrelated to machine issues.",
    "MACHINES - MAINTENANCE": "Select this ONLY if customer complaints of on going machine maintenance in an outlet.",
    "MISLEADING / DISSATISFACTION": "Select this when customers express dissatisfaction due to misleading information or unmet expectations regarding vouchers, promotions, or terms and conditions. This includes issues like invalid vouchers due to order changes, restrictions not clearly communicated, capped discounts, short promotion durations, misleading social media posts or discrepancies between terms on different platforms. This excludes scenarios where user missed out or forgot to apply their vouchers.\n",
    "MISSED OUT - DRINKS REMARKS": "Select this when a customer reports that any drink-related remarks or special instructions were not followed, including cases where customization requests were overlooked. This covers missed add-ons (e.g., velvet cream, coffee jelly, boba, pearls, drizzle), incorrect temperature preferences (e.g., warmer, less hot, less ice, hotter), wrong milk type (e.g., dairy, almond, oat, soy), incorrect ice levels (e.g., no ice, less ice), or incorrect sweetness level (e.g., no sugar, less sweet, regular sweetness). This category specifically addresses issues with unfulfilled customization requests, not broader complaints about the drink's overall quality.",
    "MISSED OUT - ORDER": "Select this intent when a customer reports that one or more items were missing from their order upon receipt. This typically results from the outlet failing to include all ordered items during packing or preparation. Issues that involve customers receiving fewer items than ordered, or specific items not being included in the delivery, should be categorized here. The issue is related to the completeness of the order as prepared by the outlet, not with the delivery execution.  Do not use this intent for minor items like stickers, straws, or add-ons, which should be categorized under \"Missed Out - Remarks.\" The focus is on the main items missing, not delivery errors or minor omissions.",
    "MISSED OUT - PROMO CODE": "Select this intent when customers want to cancel an order because they missed applying a promo code or voucher. This includes cases where they forgot to enter a voucher or discount code, apply a discount voucher, or use a \"buy one, get one free\" code. It also covers instances where a system error removed a free delivery voucher after topping up their balance, or when the customer faced an issue with an invalid voucher and wishes to cancel their order to place a new one using the voucher. The focus here is on the missed promotional opportunity, and this intent should be selected even if the customer mentions the order being \"incorrect\" but refers to missing the promo code. Excludes cases where the issue is with the order content, such as selecting the wrong items or delivery time.",
    "MISSED OUT - REMARKS": "Select this when a customer reports that non-drink-related order remarks or special instructions were not followed, such as requests for additional napkins, paper bags, or a straw for their coffee (even if they forgot to include it when placing the order). This excludes any issues related to drink customizations, such as ice, sugar, or add-ons, which should be categorized under \"Missed Out - Drinks Remarks.\" Do not use this intent for larger issues like wrong or missing drinks or food items. Also exclude issues related to missed add-ons (e.g., velvet cream, coffee jelly, boba), temperature preferences (e.g., warmer, less ice), wrong milk type, or sweetness level.",
    "NO - STRAW GIVEN / CUTLERIES": "Select this when customers complain about not receiving necessary items like straws or cutleries with their order.",
    "OOS": "Select this intent when the primary issue is that an item or ingredient is explicitly mentioned as being out of stock, sold out, or unavailable at the outlet or location, whether this occurs before or after a purchase is made. This includes situations where stock issues prevent the fulfillment of the order, such as a specific item not being available at the time of ordering or becoming unavailable during processing. The key distinguishing factor is the explicit mention of stock unavailability, which takes precedence over other concerns and directly impacts the order fulfillment process, typically resulting in cancellation and refund.",
    "OUTLET - AIR CONDITIONER ISSUE": "Select this when customers report issues with the air conditioning/AC at an outlet, causing discomfort or inconvenience during their visit.",
    "OUTLET - BLACKOUT": "Select this intent when customers report an outlet experiencing disruptions due to power supply or electrical issues, leading to cancellations or service interruptions. This includes cases where incorrect orders result directly from these electrical disruptions, such as blackouts or system failures. This includes situations where the system is down due to a power supply or source issue at the outlet, an electrical problem in the nearby area affecting delivery, or the outlet being unable to operate due to a power outage or lack of electricity. Additionally, the intent covers cases where the outlet lacks electricity or is affected by a blackout, but it excludes instances where the outlet is not open or the delay is purely time-related without mention of electrical issues.",
    "OUTLET - FLOODED": "Select this when customers report that an outlet was affected by flooding, causing disruptions to normal operations.\n",
    "OUTLET - INTERNET ISSUE": "You will only select this if customer complaints of internet or wifi or connective issues in an outlet.",
    "OUTLET - WATER DISRUPTION": "Select this when customers or staff report water supply issues at an outlet, impacting its ability to operate. This includes cases where the outlet is unable to make coffee due to a lack of water, or where the outlet is temporarily closed because of a clog issue or a machine problem that caused a water disruption. Additionally, it covers situations where orders were canceled due to no water supply in the area or a water shortage, as well as instances where the outlet was unable to prepare orders due to a water-related issue. In these cases, the order may have been partially prepared or entirely unfulfilled due to the water disruption, leading to customer cancellation and a refund request. The key is that the problem originates from the outlet's inability to operate due to water issues, not a mistake on the customer’s part.",
    "OUTLET DETAILS": "Select this when customers inquire about ZUS related outlet, place, location and information such as launch/opening data, operating hours, location, parking, or ask for assistance with lost items left at the outlet.",
    "OUTLET NOT OPEN": "Select this intent when customers report that an outlet was unexpectedly closed or not operational, even though they were able to place an order through the app. This includes situations where the customer couldn't locate a newly opened ZUS outlet, needed to cancel their order because the store was closed with no staff available, or placed an order at an outlet that was physically closed. It also covers instances where the outlet was not prepared to fulfill orders or where a technical issue allowed the outlet to accept orders despite being unable to fulfill them. This intent excludes cases where a long queue prevents the outlet from accepting new orders.",
    "PACKAGING": "Select this when customer complaints relate to the quality or adequacy of packaging, regardless of whether a spill occurred. This category focuses on packaging failures that could affect product quality or safety even if no spillage happens. It includes issues like improper seals, broken bottle caps, wrong-sized containers, or lids not being secure. Spills caused by packaging failures that happen before delivery should also be classified here. Examples include a bottle cap breaking during normal handling, a lid coming loose before transport. or iced drinks served in inadequate containers.",
    "PARTNERSHIP / SPONSOR": "Select this when customers reach out to enquire about working with ZUS or seek sponsorship from ZUS. This includes requests for business partnerships, collaborations, or sponsorship opportunities.\n",
    "PAYMENT ERROR / FAILURE": "Select this intent when customers experience technical issues or errors during the payment process. This includes situations where payments are deducted from the customer's account but not reflected in the system, payments are stuck in a pending state due to technical issues, or where transactions remain pending due to delays or application bugs. It covers problems like wallet top-ups or payments not showing in the account, failed transactions despite funds being deducted, or rejected payments due to system issues such as multiple credit cards or invalid transactions. The key focus here is on technical failures or glitches preventing the payment from being processed or recorded correctly.",
    "PAYMENT STATUS": "Select this intent when customers inquire about the current status of a payment they made. It focuses on situations where there are no technical failures or delays, and the customer simply seeks confirmation about whether the payment was completed or is still pending. This intent excludes cases where the payment was deducted but not reflected in the system, or where processing delays or system issues are involved. It typically involves customers asking if their payment was received or processed correctly without any mention of a failure or delay.",
    "PERFORMANCE - BARISTA BEHAVIOUR / SERVICE": "Select this intent when customers report issues related to barista behavior, service quality, or delays in service, including confusion caused by the app incorrectly marking an order as \"delivered\" before pickup or failing to update the order status after preparation or collection. This includes frustration when the order status has not updated despite notifications of baristas preparing the order, prolonged wait times due to staff forgetting to mark orders as \"done\" or \"pickup ready,\" and repeated mistakes where baristas fail to correctly read the customer's order, requiring reminders. It also covers situations where the order status remains as \"prepared\" or \"barista preparing\" in the app, even after the customer has already collected their coffee. Additionally, customer complaints about inappropriate barista behavior, such as excessive noise or vaping, are included, along with failures to ask for phone numbers to collect ZUS points. Communication and understanding issues between baristas and customers are also addressed. This intent excludes issues related to long queues or situations outside the barista or staff's control, such as the outlet being unable to fulfill orders.",
    "PERFORMANCE - OUTLET / STAFF HYGIENE": "Select this when customers complain about the cleanliness or hygiene of the outlet or staff, such as unclean tables, overflowing trash bins, or staff not following hygiene protocols. Exclude issues related to water disruption, blackout, air conditioning/AC, internet/wifi issues, KDS/point of sales, machine.",
    "PICKUP / DELIVERY MISTAKES": "Select this when a customer mistakenly selects the wrong fulfillment option, choosing pickup instead of delivery, or vice versa. The customer typically realizes the error after placing the order and contacts support to request a change in how they will receive their order. The key issue is the incorrect selection of pickup or delivery during the ordering process, and the customer’s goal is to modify the fulfillment method, not to change or cancel the order itself. In these cases, the order contents are usually correct, and the request is centered on adjusting how the order is collected or delivered.",
    "PICKUP INFO / STATUS": "Select this when customers inquire about the status of their order. This includes both situations where the inquiry is made within 15 minutes of placing the order and when it is made after 15 minutes.",
    "PRODUCT": "Select this when customers give twist, improvements, feedback or suggestions specifically about food, drinks, pastries, cakes, recipes or ZUS Merchandise. This includes opinions on current products and ideas for new offerings, product options or menu related.\n",
    "PRODUCT / MENU DETAILS": "Select this when customers inquire about the menu, product details, nutrition, similar products, options/add ons and potential allergies\n",
    "PRODUCTS / SUPPLIERS": "Select this when the customer wants to offer products, services to ZUS coffee or want to know more how they can become a supplier to ZUS coffee",
    "QUALITY COMPLAINT - DRINK": "Select this category when customers express dissatisfaction with the overall quality of the beverage, including issues such as taste discrepancies (e.g., too strong, bland, or incorrect flavor), contamination (e.g., coffee residues or foreign substances), concerns about freshness or expired ingredients, and noticeable differences in taste between outlets. This category also applies when missed customizations directly affect the perceived quality, but not when the sole issue is the missing customization itself. Excludes issues related purely to foam and volume. It also covers complaints where customers report general problems with the drink's quality but may lack specific evidence or follow-up.",
    "QUALITY COMPLAINT - FOOD - CAKE": "Select this when customers complain specifically related to the quality of cakes, including issues with taste (e.g., sour or strange flavors), freshness (e.g., cakes perceived as stale), and contamination (e.g., foreign objects found in the cake). It also includes cases where customers allege issues but do not provide further evidence or respond to follow-up inquiries.",
    "QUALITY COMPLAINT - FOOD - PASTRIES": "Select this when customers complain regarding pastries, including those served hot, such as receiving them cold, lacking filling, or containing foreign objects. It also covers situations where the customer reports an issue but does not provide further evidence or respond to inquiries.",
    "QUALITY COMPLAINT - HOT FOOD": "Select this when customers complain about the quality of hot, non-pastry food items. It includes issues such as improper cooking (e.g., food that is cold inside, undercooked, too dry, or overly salty), contamination (e.g., foreign objects), insufficient ingredients, or expired items. This intent also covers situations where the customer reports a problem but does not provide photos or respond to follow-up inquiries. Pastries served hot should be classified under the \"Quality Complaint - Food - Pastries\" intent.",
    "RECEIVED EXTRA ITEM(S)": "Select this when customers report receiving additional items in their order that were not intended for them, either due to barista or rider mistakes.",
    "REFUND DELIVERY FEES": "Select this when customers request a refund of delivery fees due to circumstances like heavy rain or a missing rider, leading them to opt for self-pickup instead.",
    "REFUND ERROR / FAILURE": "Select this when customers complain specifically about not receiving their refund. This includes cases where the refund has been delayed, processed but not reflected, or other issues related to the refund not being completed as expected. This category excludes issues related to stock availability; it focuses solely on the problems with the refund process itself.",
    "REFUND STATUS": "Select this when customers inquire about the status of a refund, whether for a balance withdrawal or an order refund. This includes requests for updates on when the refund will be completed.\n",
    "RIDER BEHAVIOR": "Select this when the issue involves inappropriate or unprofessional conduct by the delivery rider that affects the service experience. This includes situations where the rider exhibits rude behavior, fails to communicate effectively (such as not answering calls or hanging up), requests additional payment unexpectedly, or encounters logistical issues like a motorbike breakdown. Additionally, it covers cases where the rider updates the delivery status to \"delivered\" before actually completing the delivery or shows other forms of unresponsiveness or negligence during the delivery process.",
    "SLOW DELIVERY SERVICE": "Select this when customers report that their orders were not delivered within the expected 45-minute timeframe. This intent is used specifically for cases where the primary issue is the speed of delivery, rather than technical system problems. Descriptions for this intent will focus on delays caused by external factors, such as rider speed or traffic, and are not related to system glitches or order synchronization issues. The key distinguishing factor is that the delay is purely a logistical issue without mention of any technical or system-related problems.",
    "SLOW ORDER PREPARATION": "Select this when customers complain about long wait times for their order to be prepared, particularly when the preparation time exceeds 20 minutes but is less than 45 minutes. ",
    "SLOW RIDER ALLOCATION": "Select this when customers report that a rider was not scheduled or assigned to the order in a timely manner, leading to delays in the order delivery. This includes situations where there is a prolonged period without a rider being allocated to the order, causing a delay in pickup or delivery. The focus here is on the timing and scheduling of rider assignments rather than the rider’s behavior or conduct.",
    "SPILLAGE": "Select this when a customer complains that their order spilled due to issues during delivery. This category focuses on spills that happen because of mishandling during transit, such as containers tipping over or packages breaking. Even if the packaging was intact at the time of handover, the spill must be caused by factors related to the delivery process. Packaging-related failures resulting in spillage that occurred during transit should not be classified here. This classification also includes cases where the cup or container arrived broken, resulting in spillage. The key factor for this category is that the spill happened during delivery, regardless of the initial packaging condition.",
    "SUGGESTION - NEW OUTLET": "Select this when customers suggest new location for ZUS outlets or inquire why ZUS is not opening in certain locations. This includes requests for expansion/opening at a specific areas.",
    "TRACKING ERROR": "Select this when customers report that they are unable to view the rider tracking link or details in the ZUS app. This includes issues where the tracking feature does not work from the customer's end or the delivery information is missing.",
    "UNAUTHORIZED PAYMENT": "Select this when customers report that a payment/order was made without their authorization, either by another customer or through a payment gateway without their consent. This includes cases where unauthorized transactions result in discrepancies in their account.",
    "UNSUBSCRIBE": "Select this when customers mention that they want to be removed or unsubscribed from the promotional email/notification list. This includes situations where the customer explicitly requests to stop receiving promotional communications.\n",
    "WRONG ADDRESS / RECIPIENT": "Select this when the customer received an order, but it was the wrong one, or the delivery was made to the wrong person or address. This includes cases where the customer received someone else’s order or the order was delivered to the wrong location due to a delivery error. The defining feature here is that the customer received an incorrect order, and the issue is related to misdelivery, not non-receipt. If the customer did not receive any order at all, the issue should be categorized as \"Failed Delivery.\"",
    "WRONG DRINK": "Select this intent when the customer reports receiving a specific incorrect drink or a drink that is missing key ingredients. This intent is focused solely on drink-related mistakes, where the issue is limited to the drink itself. It excludes cases involving customization errors like milk type, sweetness level, ice amount, temperature, or additional add-ons (such as velvet cream, boba, or drizzle). The customer’s complaint should be about receiving the wrong drink entirely or a drink that is missing its key components. The resolution typically involves resending the correct drink or offering compensation specific to that drink.",
    "WRONG FOOD": "Select this when a customer receives an incorrect food item due to issues such as incorrect labeling, packing errors, or the customer mistakenly ordering the wrong item. This category is focused specifically on errors involving a single food item within the order, such as receiving a puff instead of lasagna or a chocolate donut instead of a chocolate roll. The resolution typically involves addressing the error related to that particular food item, either by replacing it or issuing a refund.",
    "WRONG ORDER / ITEM(S)": "Select this intent when the issue involves the entire order or multiple items, including drinks and/or food, being incorrect or incomplete. This applies to broader fulfillment errors, such as receiving someone else’s order, missing items, or multiple incorrect items, affecting more than just a single drink. The problem may include a mix-up with both food and drinks or a general issue with how the entire order was handled. This intent should be used when the scope of the mistake goes beyond just one drink and affects multiple aspects of the order. The resolution generally involves resending the correct items, refunding the customer, or recovering the missing parts of the order.",
    "WRONG OUTLET / ADDRESS - VOUCHER CODE": "Select this intent when customers report ordering or selecting from the wrong location or outlet. This includes cases where the issue is resolved by offering the customer a voucher as compensation.",
    "ZUS BALANCE WITHDRAWAL": "Select this when customers inquire about or request assistance with withdrawing their ZUS Balance. This includes questions about the status or updates on balance withdrawal requests, instructions on how to withdraw their balance, and procedural information related to the withdrawal process. This intent is focused on handling the procedural aspects of withdrawing funds from the ZUS account. This intent excludes issues related to discrepancies in ZUS Balance, refunds, loyalty points or vouchers."
}