{
    "ACCOUNT & CONTACT MANAGEMENT": "This category involves customer requests related to managing personal account information and communication preferences. It includes updating contact details such as phone numbers or emails, handling unsubscription from promotional communications, and addressing procedural queries regarding the withdrawal of balances from the customer’s account. This category excludes troubleshooting loyalty, gift card issues, and discrepancies related to rewards or refunds.",
    "APP FUNCTIONALITY": "This category covers customer issues related to the technical performance and usability of the app. It includes problems such as app lag, freezing, glitches, or slow loading, which impact various features like ordering, applying promotions, or logging in. It also encompasses issues with receiving One-Time Passwords (OTPs) for authentication and difficulties with tracking deliveries through the app. Excluded are problems related to broader technical outages or updates to contact information.",
    "BUSINESS DEVELOPMENT AND PARTNERSHIPS": "This category includes inquiries and proposals related to forming business relationships with the company. It encompasses requests for partnerships, sponsorships, franchising opportunities, suggestions for new outlet locations, and supplier inquiries. Customers may express interest in collaborating, investing, or offering products and services to the business. This category does not include customer feedback unrelated to business expansion or partnerships.",
    "FEEDBACK / SUGGESTIONS": "This category covers customer input related to both positive and negative experiences, including complaints, compliments, and product or service suggestions. It includes general complaints about service, misleading promotions, dissatisfaction with information, and employee welfare concerns. Positive feedback such as praise for staff or products also falls under this category, as do customer suggestions for product improvements or new offerings. This category excludes specific operational issues like order mistakes or hygiene-related complaints.",
    "GENERAL INQUIRY / PRODUCT INQUIRY": "This category encompasses customer questions about general company information, product offerings, and promotions. It includes inquiries related to loyalty points, vouchers, discounts, outlet locations, operating hours, and product details such as menu options, nutritional information, and potential allergens. This category is focused on informational requests without any reported issues or complaints and excludes cases of missing or incorrect loyalty points or vouchers.",
    "LOCATION AND ADDRESS ISSUES": "This category covers customer errors related to selecting the wrong outlet or entering incorrect addresses, resulting in order cancellations or adjustments. It includes situations where customers request cancellations due to choosing an incorrect location and cases where vouchers are issued as compensation for these mistakes. This category focuses on customer-driven location errors and excludes operational issues at the outlet.",
    "LOYALTY AND REWARDS": "This category covers customer issues and inquiries related to loyalty programs, rewards, and promotional codes. It includes problems with redeeming gift cards, incorrect loyalty point calculations, missing points, and difficulties applying or redeeming vouchers and discounts in the app. It also includes cases where customers missed applying a promo code or voucher and wish to cancel or adjust their order. This category excludes general inquiries about loyalty points and situations where the issue is unrelated to rewards, such as incorrect order content.",
    "ORDER FULFILLMENT": "This category addresses issues related to the processing, preparation, and delivery of customer orders. This category focuses on ensuring the successful and timely completion of orders and excludes minor issues like missing small items or non-operational delays not directly tied to order fulfillment. It includes delays in order preparation, long waiting times, rider unavailability, out-of-stock items, and incomplete orders. It also covers problems where customers are outside the delivery range or where the app incorrectly handles location information, preventing order placement. ",
    "ORDER PLACEMENT ERRORS": "This category includes customer issues related to mistakes made during the order placement process. It covers cancellations or amendments due to incorrect items, duplicate orders. It also includes errors where customers mistakenly select the wrong fulfillment option, such as choosing pickup instead of delivery. The focus is on correcting or canceling orders due to user input errors, excluding cancellations caused by operational or system issues at the outlet.",
    "ORDER STATUS & TRACKING": "This category strictly covers customer inquiries about the current status or progress of their orders, whether for delivery or pickup. It includes requests for updates or clarifications on the order’s preparation and delivery timeline. All complaints, amendment requests, or issues related to service quality, incorrect orders, or barista performance are excluded from this category. The focus here is solely on inquiries about the tracking or completion of an order, not on any dissatisfaction or requests for changes.",
    "OUTLET EQUIPMENT AND INFRASTRUCTURE": "This category addresses issues related to equipment malfunctions or infrastructure problems at the outlet that affect operations. It includes technical failures in the Kitchen Display System (KDS), Point of Sales (Xilnex), coffee machines, and other essential equipment. It also covers disruptions caused by power outages, water supply issues, air conditioning problems, internet connectivity issues, and flooding. The focus is on operational failures that prevent the outlet from fulfilling orders, leading to delays, cancellations, or service interruptions. This category excludes customer-related errors or delays unrelated to equipment or infrastructure issues.",
    "OUTLET OPERATIONS": "This category encompasses issues related to the day-to-day functioning of an outlet, including its availability, staff behavior, and hygiene. It includes cases where customers report that an outlet was unexpectedly closed or not operational despite accepting orders, as well as complaints about barista behavior, service delays, or mistakes in order handling. Additionally, it covers concerns about the cleanliness and hygiene of the outlet or staff. Operational issues due to equipment failures, infrastructure problems, or long queues outside staff control are excluded.",
    "ORDER HANDLING AND PACKAGING": "This category addresses minor issues related to how orders are handled and packaged, focusing on missing non-food items such as straws, cutlery, napkins, or paper bags, and improperly followed special requests. It also includes concerns about packaging quality, spillage during delivery, and cases where extra items were unintentionally provided. The focus is on minor, non-food-related issues, and specifically excludes major missing items like food or drinks as well as issues related to food or drink customizations (e.g., missing add-ons, temperature preferences).",
    "PAYMENT AND REFUNDS": "This category addresses customer issues related to payment processing, refunds, and unauthorized transactions. It includes situations such as double charges, payment errors or failures, inquiries about payment or refund status, and incorrect refund amounts or channels. It also covers cases of unauthorized payments and refund delivery issues. The focus is on resolving technical problems with payments and refunds or providing updates on their status. This category excludes general inquiries without evidence of payment issues.",
    "PROBLEMATIC / FAILED DELIVERY": "This category addresses issues related to failed or incorrect deliveries. It includes cases where the customer was unreachable, the order was delivered to the wrong person or location, or the rider marked the order as delivered without completing the delivery. It also covers inappropriate rider behavior, delays in delivery speed, and slow rider allocation. The focus is on problems with the delivery process itself, whether logistical, behavioral, or due to communication breakdowns. This category excludes issues related to restaurant operations or technical system failures.",
    "ORDER ACCURACY": "This category focuses on significant errors related to the correctness of food and drink items in the order. It includes issues such as receiving a drink at the wrong temperature (e.g., hot instead of iced), missing specific drink customizations (e.g., add-ons or temperature preferences), and receiving entirely incorrect or incomplete food or drink items due to labeling or packing mistakes. It also covers broader issues affecting the entire order or multiple items, including both food and drinks, where the order is incorrect or incomplete. This category excludes minor issues related to non-food items and packaging quality.",
    "PRODUCT QUALITY / HYGIENE ISSUE": "This category addresses customer concerns related to the overall quality and safety of food and beverages. It includes complaints about the cleanliness and safety of products, such as the presence of foreign objects or expired items, as well as issues affecting taste, freshness, and general quality. Complaints may involve discrepancies in flavor, texture, or appearance, contamination, and any other factors impacting the perceived quality or safety of the food or drink."
}